/*

[브랜치 예시]
 - main        : 최종 제출용            ☆☆☆절대 건들이지 말 것!!!☆☆☆

 - dev         : 개발 도중 사용하게 될 게임 파일  (보통의 경우 이곳에 병합)
 - test        : 개발된 기능 테스트
 - design/명칭 : 기능 변화 없는 시각적인 요소
 - feat/기능명 : 새로운 기능 개발
 - fix/기능명  : 발생한 버그 수정

[커밋 예시]
 - 새로운 기능 추가    /   feat : 캐릭터 이동 기능 추가
 - 오류 수정           /   fix : 무기 데미지 적용 오류
 - 코드 리팩토링       /   refactor : 몬스터 스폰 기능 리팩토링
 - 기능 테스트         /   test : 맵 생성 기능 테스트
 - 환경,설정 수정      /   chore : 외부 에셋 추가
 - 파일,폴더명 수정    /   rename : resources -> Resources
 - 파일,폴더 삭제      /   remove : adressable 폴더 삭제
 - 주석 추가 or 변경   /   comment : 플레이어 컨트롤러 주석 추가

*/